s15/sync-load-test/sync.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9 r1437961">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="ServiceURL" elementType="Argument">
            <stringProp name="Argument.name">ServiceURL</stringProp>
            <stringProp name="Argument.value">http://s15.outdoor.mobilengine.com/services/mobileservice/mobileservice.asmx</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
        <stringProp name="delimiter">;</stringProp>
        <stringProp name="filename">users.csv</stringProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">All threads</stringProp>
        <boolProp name="stopThread">false</boolProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="${__machineName()}" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1000</stringProp>
        <longProp name="ThreadGroup.start_time">1363184761000</longProp>
        <longProp name="ThreadGroup.end_time">1363184761000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="BeginSyncSession" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.URL_DATA">${ServiceURL}</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;v:Envelope xmlns:i=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:d=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:c=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:v=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
	&lt;v:Header&gt;
		&lt;n0:SoapHeaderME xmlns:n0=&quot;http://www.MobileEngine.hu/2009/MobileService-Extension.soap&quot;&gt;
			&lt;HardwareId&gt;0000000000000000&lt;/HardwareId&gt;
			&lt;Username&gt;${Username}&lt;/Username&gt;
			&lt;PasswordToken&gt;${PasswordToken}&lt;/PasswordToken&gt;
		&lt;/n0:SoapHeaderME&gt;
		&lt;n1:ClientVersion xmlns:n1=&quot;http://www.MobileEngine.hu/2009/MobileService-Extension.soap&quot;&gt;
			&lt;CommunicationProtocolVersion&gt;9.0.0.0&lt;/CommunicationProtocolVersion&gt;
			&lt;ApplicationRuntimeVersion&gt;0.0.0.0&lt;/ApplicationRuntimeVersion&gt;
			&lt;ClientPlatform&gt;Android&lt;/ClientPlatform&gt;
			&lt;ClientPlatformVersion&gt;2.1-update1&lt;/ClientPlatformVersion&gt;
		&lt;/n1:ClientVersion&gt;
	&lt;/v:Header&gt;
	&lt;v:Body&gt;
		&lt;BeginSynchronizationSession  xmlns=&quot;http://www.MobileEngine.hu/2008/MobileService.soap&quot; id=&quot;o0&quot; c:root=&quot;1&quot;&gt;
			&lt;rgtabverClient&gt;
				&lt;Tabver Tabn=&quot;FormList&quot; Ver=&quot;-1&quot; /&gt;
				&lt;Tabver Tabn=&quot;MetaDataList&quot; Ver=&quot;-1&quot; /&gt;
				&lt;Tabver Tabn=&quot;AssignmentDataList&quot; Ver=&quot;-1&quot; /&gt;
				&lt;Tabver Tabn=&quot;MobileClientConfigurations&quot; Ver=&quot;-1&quot; /&gt;
				&lt;Tabver Tabn=&quot;MobileClientConfigurationAttachment&quot; Ver=&quot;-1&quot; /&gt;
				&lt;Tabver Tabn=&quot;Reference_nemleteyik&quot; Ver=&quot;28&quot; /&gt;
			&lt;/rgtabverClient&gt;
		&lt;/BeginSynchronizationSession&gt;
	&lt;/v:Body&gt;
&lt;/v:Envelope&gt;
</stringProp>
          <stringProp name="SoapSampler.SOAP_ACTION">http://www.MobileEngine.hu/2008/MobileService.soap/BeginSynchronizationSession</stringProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">true</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
        </SoapSampler>
        <hashTree>
          <XPathExtractor guiclass="XPathExtractorGui" testclass="XPathExtractor" testname="Extract SessionId" enabled="true">
            <stringProp name="XPathExtractor.refname">Sessionid</stringProp>
            <stringProp name="XPathExtractor.xpathQuery">//BeginSynchronizationSessionResult/@Id</stringProp>
            <boolProp name="XPathExtractor.validate">false</boolProp>
            <boolProp name="XPathExtractor.tolerant">false</boolProp>
            <boolProp name="XPathExtractor.namespace">false</boolProp>
          </XPathExtractor>
          <hashTree/>
          <XPathExtractor guiclass="XPathExtractorGui" testclass="XPathExtractor" testname="Extract StTktNext" enabled="true">
            <stringProp name="XPathExtractor.refname">StTktNext</stringProp>
            <stringProp name="XPathExtractor.xpathQuery">//Chsp/@StTktNext</stringProp>
            <boolProp name="XPathExtractor.validate">false</boolProp>
            <boolProp name="XPathExtractor.tolerant">false</boolProp>
            <boolProp name="XPathExtractor.namespace">false</boolProp>
          </XPathExtractor>
          <hashTree/>
        </hashTree>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="EndSyncSession" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.URL_DATA">${ServiceURL}</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:mob=&quot;http://www.MobileEngine.hu/2009/MobileService-Extension.soap&quot; xmlns:mob1=&quot;http://www.MobileEngine.hu/2008/MobileService.soap&quot;&gt;
   &lt;soapenv:Header&gt;
  	      &lt;n0:SoapHeaderME xmlns:n0=&quot;http://www.MobileEngine.hu/2009/MobileService-Extension.soap&quot;&gt;
			&lt;HardwareId&gt;0000000000000000&lt;/HardwareId&gt;
			&lt;Username&gt;${Username}&lt;/Username&gt;
			&lt;PasswordToken&gt;${PasswordToken}&lt;/PasswordToken&gt;
		&lt;/n0:SoapHeaderME&gt;
		&lt;n1:ClientVersion xmlns:n1=&quot;http://www.MobileEngine.hu/2009/MobileService-Extension.soap&quot;&gt;
			&lt;CommunicationProtocolVersion&gt;3.4.0.0&lt;/CommunicationProtocolVersion&gt;
			&lt;ApplicationRuntimeVersion&gt;0.0.0.0&lt;/ApplicationRuntimeVersion&gt;
			&lt;ClientPlatform&gt;Android&lt;/ClientPlatform&gt;
			&lt;ClientPlatformVersion&gt;2.1-update1&lt;/ClientPlatformVersion&gt;
		&lt;/n1:ClientVersion&gt;
   &lt;/soapenv:Header&gt;
   &lt;soapenv:Body&gt;
      &lt;mob1:EndSynchronizationSession&gt;
         &lt;mob1:idChs&gt;${SessionId}&lt;/mob1:idChs&gt;
      &lt;/mob1:EndSynchronizationSession&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.SOAP_ACTION">http://www.MobileEngine.hu/2008/MobileService.soap/EndSynchronizationSession</stringProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">true</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
        </SoapSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ThreadsStateOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="Active Threads Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">true</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TimesVsThreadsGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="Response Times vs Threads" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">true</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="Response Times Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">true</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseCodesPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="Response Codes per Second" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="Transactions per Second" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">true</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CompositeResultCollector guiclass="kg.apc.jmeter.vizualizers.CompositeGraphGui" testclass="kg.apc.jmeter.vizualizers.CompositeResultCollector" testname="Composite Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <collectionProp name="COMPOSITE_CFG">
          <collectionProp name="">
            <stringProp name="-1773057976">Active Threads Over Time</stringProp>
            <stringProp name="2032981088">Response Times Over Time</stringProp>
            <stringProp name="-44774270">Transactions per Second</stringProp>
            <stringProp name="-44774270">Transactions per Second</stringProp>
          </collectionProp>
          <collectionProp name="">
            <stringProp name="2133254370">Overall Active Threads</stringProp>
            <stringProp name="-1549391110">Overall Response Times</stringProp>
            <stringProp name="117711132">Successful Transactions per Second</stringProp>
            <stringProp name="-1517411905">Failed Transactions per Second</stringProp>
          </collectionProp>
        </collectionProp>
      </kg.apc.jmeter.vizualizers.CompositeResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>